app/views/inventories/show.html.erb

  <% if @inventory.user == current_user %>
    <% if @inventory.related_inventory_foods.any? %>
---
SELECT 1 AS one FROM "inventory_foods" WHERE "inventory_foods"."inventory_id" = $1 LIMIT $2  [["inventory_id", 2], ["LIMIT", 1]]