app/controllers/foods_controller.rb

  def create
    @food = Food.new(food_params)
    @food.user = current_user
    if @food.save
---
INSERT INTO "foods" ("name", "measurement_unit", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "rice"], ["measurement_unit", 0], ["price", 50000], ["created_at", "2022-09-29 15:45:36.204758"], ["updated_at", "2022-09-29 15:45:36.204758"], ["user_id", 1]]