app/controllers/inventories_controller.rb

  def show
    @user = current_user
    @inventory = @user.inventories.find(params[:id])
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1 AND "inventories"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]

  def create
    @inventory = Inventory.new(inventory_params)
    @inventory.user_id = current_user.id

    render :new unless @inventory.save
---
INSERT INTO "inventories" ("name", "created_at", "updated_at", "user_id", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "eeee"], ["created_at", "2022-09-29 13:25:45.924710"], ["updated_at", "2022-09-29 13:25:45.924710"], ["user_id", 1], ["description", "fff"]]

  def destroy
    @inventory = Inventory.find_by(id: params[:id])

    if @inventory.destroy
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "inventories" WHERE "inventories"."id" = $1  [["id", 1]]