app/controllers/inventory_foods_controller.rb

  def new
    @inventory_food = InventoryFood.new
    @foods = Food.all
---
SELECT "foods".* FROM "foods"

  def set_inventory
    @inventory = Inventory.find(params[:inventory_id])
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]