app/controllers/recipes_controller.rb

  def show
    @recipe = Recipe.find(params[:id])
    @recipe_foods = @recipe.recipe_foods
    @inventories = Inventory.all
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "inventories".* FROM "inventories"

  def public
    @recipes = Recipe.where(public: true)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]

  def create
    @user = current_user
    @recipe = Recipe.new(recipe_params)
    @recipe.user = @user
    if @recipe.save
---
INSERT INTO "recipes" ("name", "preparation_time", "cooking_time", "description", "public", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"